#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
tls_private_key.rsa_key: Refreshing state... [id=2aa29a9bd5a6c220d09e1e450f903fce83da03a1]
local_file.tfkey: Refreshing state... [id=4009826ca1abbde45f19d89a606066a4416a4d27]
aws_vpc.main: Refreshing state... [id=vpc-0f19ce640dd8640d7]
aws_key_pair.terraform_key: Refreshing state... [id=terraform_key]
data.aws_ami.java-ami: Reading...
aws_eip.nat_gateway: Refreshing state... [id=eipalloc-02bcb300f41bc4b9b]
data.aws_ami.java-ami: Read complete after 0s [id=ami-0ab08eb09c75ae7ea]
aws_internet_gateway.internet_gateway: Refreshing state... [id=igw-031d16e32481ff73c]
aws_subnet.publicsubnet_2: Refreshing state... [id=subnet-0d455184cb7ef9882]
aws_security_group.allow_http: Refreshing state... [id=sg-063c9490b04b7ca61]
aws_subnet.privatesubnet_2: Refreshing state... [id=subnet-0676f55817602d872]
aws_subnet.privatesubnet_4: Refreshing state... [id=subnet-05296d277a93e550b]
aws_subnet.privatesubnet_1: Refreshing state... [id=subnet-0028a4b75734be013]
aws_subnet.privatesubnet_3: Refreshing state... [id=subnet-04990de6d9ffe6496]
aws_security_group.allow_ssh: Refreshing state... [id=sg-0d5317724b9adfc3b]
aws_security_group.elb: Refreshing state... [id=sg-00f2ba8159e02c180]
aws_subnet.publicsubnet_1: Refreshing state... [id=subnet-0401fad4a155807a1]
aws_launch_template.ec2_config: Refreshing state... [id=lt-032c29fb6a3c9201f]
aws_nat_gateway.nat_gateway: Refreshing state... [id=nat-0b0ff7d24b273acf3]
aws_elb.elastic-load-balancer: Refreshing state... [id=ELB]
aws_instance.bastion-host: Refreshing state... [id=i-09b9f24e2ef56f7d6]
aws_route_table.public_route_table: Refreshing state... [id=rtb-00b21e4650721d060]
aws_db_subnet_group.db-subnet-group: Refreshing state... [id=db-subnet-group]
aws_route_table.private_route_table: Refreshing state... [id=rtb-0a77afe745fbe209d]
aws_route_table_association.public_route_table_association_2: Refreshing state... [id=rtbassoc-0e6f1dbcda4cef6ff]
aws_route_table_association.public_route_table_association_1: Refreshing state... [id=rtbassoc-0332f6c981788eb5d]
aws_route_table_association.private_route_table_association_1: Refreshing state... [id=rtbassoc-02563d4fa0ec95b0d]
aws_route_table_association.private_route_table_association_3: Refreshing state... [id=rtbassoc-05b4bfba68b9bd0b2]
aws_route_table_association.private_route_table_association_4: Refreshing state... [id=rtbassoc-0f7150c6798992e8d]
aws_route_table_association.private_route_table_association_2: Refreshing state... [id=rtbassoc-0f38714835c5f99b7]
aws_autoscaling_group.auto_scaling_group: Refreshing state... [id=Auto Scaling Group]
aws_db_instance.postgres-db: Refreshing state... [id=terraform-20230321145156076600000001]
aws_autoscaling_attachment.asg_attachment: Refreshing state... [id=Auto Scaling Group-20230321145305723200000006]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_autoscaling_group.auto_scaling_group will be updated in-place
  ~ resource "aws_autoscaling_group" "auto_scaling_group" {
        id                        = "Auto Scaling Group"
      ~ load_balancers            = [
          - "ELB",
        ]
        name                      = "Auto Scaling Group"
        # (22 unchanged attributes hidden)

      ~ launch_template {
            id      = "lt-032c29fb6a3c9201f"
            name    = "terraform-20230321145156084200000002"
          ~ version = "1" -> (known after apply)
        }

        # (2 unchanged blocks hidden)
    }

  # aws_launch_template.ec2_config will be updated in-place
  ~ resource "aws_launch_template" "ec2_config" {
      ~ default_version         = 1 -> (known after apply)
        id                      = "lt-032c29fb6a3c9201f"
      ~ image_id                = "ami-06266744686ddf24b" -> "ami-0ab08eb09c75ae7ea"
      ~ latest_version          = 1 -> (known after apply)
        name                    = "terraform-20230321145156084200000002"
        tags                    = {}
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # local_file.tfkey will be created
  + resource "local_file" "tfkey" {
      + content              = (sensitive value)
      + directory_permission = "0777"
      + file_permission      = "400"
      + filename             = "tfkey"
      + id                   = (known after apply)
    }

Plan: 1 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @ludicsa, Action: `pull_request`*